# St7SetCreepConcreteShrinkageTableData

Associates a table with the concrete shrinkage data for the specified creep law definition.

long St7SetCreepConcreteShrinkageTableData(long uID, long CreepID, long TableID)

Input Parameters

uID

Strand7 model file ID.

CreepID

Creep layout ID.

TableID

Strain vs Time table ID, or 0 for none.